<?php
/**
 * Strings for component 'report_competency_statistic'
 *
 * @package    coursereport
 * @subpackage competency_statistic
 * @copyright  2022
 * @license    -
 */

$string['reportname'] = 'Статистика компетенций';
$string['pluginname'] = 'Статистика компетенций';
$string['strftimetime'] = '%I:%M:%S %p';
$string['viewlogs'] = 'View logs';
$string['statistic_help'] = 'Статистика по курсу - это статистика освоения компенетций по одному курсу. Статистика по курсам - это статистика освоения компенетций по всем проходимым курсам. Освоенные компетенции - это освоенные компетенции за все время обучения.';
$string['statistic_for_course_help'] = 'На левой диаграмме показаны освоенные компетенции по текущему курсу. На правой диаграмме показано количество выполненных заданий по освоенным компетенциям. Серым цветом отмечены неосвоенные компетенции и невыполненные задания.';
$string['statistic_for_all_competencies_help'] = 'На круговой диаграмме показаны все освоенные компетенции студента за предыдущие курсы обучения. Для каждой компетенции в скобках указано количество дисциплин закрывающих данную компетенцию и через двоеточие указан средний бал за экзамены.';
$string['statistic_for_all_course_help'] = 'На круговой диаграмме показаны все освоенные компетенции студента по текущим проходимым дисциплинам.';
